Autodesk.Revit.DB.Structure.AnalyticalStructuralRole
Indicates the structural role for the analytical elements.
Since:
2023
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRolePanel
Member plays role of structural panel.

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleWall
Member plays role of structural wall.

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleFloor
Member plays role of structural floor.

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleGirder
Member plays role of structural girder.

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleMember
Member plays role of structural member.

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleColumn
Member plays role of structural column.

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.StructuralRoleBeam
Member plays role of structural beam.

Autodesk.Revit.DB.Structure.AnalyticalStructuralRole.Unset
No structural role by default.